#### Terraform Plan for `sit` 📖

<details><summary>Show Plan</summary>

```terraform
module.github_archive_repos.data.github_repository.target["Laddu"]: Reading...
module.github_repos.github_repository.this["lot"]: Refreshing state... [id=lot]
module.github_repos.github_repository.this["Akshh"]: Refreshing state... [id=Akshh]
module.github_repos.github_repository.this["alone"]: Refreshing state... [id=alone]
module.github_repos.github_repository.this["sai3"]: Refreshing state... [id=sai3]
module.github_repos.github_repository.this["sai2"]: Refreshing state... [id=sai2]
module.github_repos.github_repository.this["Sai"]: Refreshing state... [id=Sai]
module.github_repos.github_repository.this["ahsys"]: Refreshing state... [id=ahsys]
module.github_repos.github_repository.this["Dhyan"]: Refreshing state... [id=Dhyan]
module.github_repos.github_repository.this["Akshhay"]: Refreshing state... [id=Akshhay]
module.github_archive_repos.data.github_repository.target["Laddu"]: Read complete after 0s
module.github_repos.github_repository.this["Laddu"]: Refreshing state... [id=Laddu]
module.github_repos.github_repository.this["qwert"]: Refreshing state... [id=qwert]
module.github_repos.github_repository.this["YYCHAN"]: Refreshing state... [id=YYCHAN]
module.github_repos.github_repository.this["sai4"]: Refreshing state... [id=sai4]
module.github_repos.github_repository.this["den"]: Refreshing state... [id=den]
module.github_repos.github_repository.this["MAYBANK"]: Refreshing state... [id=MAYBANK]
module.github_repos.github_repository.this["tre"]: Refreshing state... [id=tre]
module.github_archive_repos.data.github_repository.target["adfs"]: Reading...
module.github_archive_repos.data.github_repository.target["sai"]: Reading...
module.github_archive_repos.data.github_repository.target["Dhyan"]: Reading...
module.github_repos.github_branch_default.this["Dhyan"]: Refreshing state... [id=Dhyan]
module.github_repos.github_branch_default.this["ahsys"]: Refreshing state... [id=ahsys]
module.github_repos.github_branch_default.this["lot"]: Refreshing state... [id=lot]
module.github_repos.github_branch_default.this["Laddu"]: Refreshing state... [id=Laddu]
module.github_repos.github_branch_default.this["sai4"]: Refreshing state... [id=sai4]
module.github_repos.github_branch_default.this["Akshhay"]: Refreshing state... [id=Akshhay]
module.github_repos.github_branch_default.this["sai2"]: Refreshing state... [id=sai2]
module.github_archive_repos.data.github_repository.target["adfs"]: Read complete after 1s
module.github_repos.github_branch_default.this["Sai"]: Refreshing state... [id=Sai]
module.github_archive_repos.data.github_repository.target["sai"]: Read complete after 1s
module.github_repos.github_branch_default.this["den"]: Refreshing state... [id=den]
module.github_archive_repos.data.github_repository.target["Dhyan"]: Read complete after 1s
module.github_repos.github_branch_default.this["sai3"]: Refreshing state... [id=sai3]
module.github_repos.github_branch_default.this["alone"]: Refreshing state... [id=alone]
module.github_repos.github_branch_default.this["tre"]: Refreshing state... [id=tre]
module.github_repos.github_branch_default.this["qwert"]: Refreshing state... [id=qwert]
module.github_archive_repos.terraform_data.archive["Laddu"]: Refreshing state... [id=d874305e-5b74-2a69-aa47-a31c074f8483]
module.github_archive_repos.terraform_data.archive["sai"]: Refreshing state... [id=02cb758b-c43d-4a0b-0012-70a531f8791e]
module.github_archive_repos.terraform_data.archive["Dhyan"]: Refreshing state... [id=d389b8e5-2820-a23b-8263-94c1e5e591c2]
module.github_archive_repos.terraform_data.archive["adfs"]: Refreshing state... [id=2bc14570-cb76-630f-8119-2c1066d14238]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github_archive_repos.terraform_data.archive["Laddu"] is tainted, so must be replaced
-/+ resource "terraform_data" "archive" {
      ~ id               = "d874305e-5b74-2a69-aa47-a31c074f8483" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.github_archive_repos.terraform_data.archive["adfs"] is tainted, so must be replaced
-/+ resource "terraform_data" "archive" {
      ~ id               = "2bc14570-cb76-630f-8119-2c1066d14238" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.github_repos.github_branch_default.this["Akshh"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Akshh"
    }

  # module.github_repos.github_branch_default.this["Akshhay"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Akshhay"
    }

  # module.github_repos.github_branch_default.this["Dhyan"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Dhyan"
    }

  # module.github_repos.github_branch_default.this["Laddu"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Laddu"
    }

  # module.github_repos.github_branch_default.this["MAYBANK"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "MAYBANK"
    }

  # module.github_repos.github_branch_default.this["Sai"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Sai"
    }

  # module.github_repos.github_branch_default.this["YYCHAN"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "YYCHAN"
    }

  # module.github_repos.github_branch_default.this["ahsys"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "ahsys"
    }

  # module.github_repos.github_branch_default.this["alone"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "alone"
    }

  # module.github_repos.github_branch_default.this["den"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "den"
    }

  # module.github_repos.github_branch_default.this["lot"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "lot"
    }

  # module.github_repos.github_branch_default.this["qwert"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "qwert"
    }

  # module.github_repos.github_branch_default.this["sai2"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "sai2"
    }

  # module.github_repos.github_branch_default.this["sai3"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "sai3"
    }

  # module.github_repos.github_branch_default.this["sai4"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "sai4"
    }

  # module.github_repos.github_branch_default.this["tre"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "tre"
    }

  # module.github_repos.github_branch_protection.main["Sai"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.github_repos.github_branch_protection.main["lot"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.github_repos.github_branch_protection.main["sai2"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.github_repos.github_repository.this["Akshh"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Akshh"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false
        # (1 unchanged attribute hidden)

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["Akshhay"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Akshhay"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["Dhyan"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Dhyan"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["Laddu"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Laddu"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["MAYBANK"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NI"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "MAYBANK"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["Sai"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Sai"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["YYCHAN"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "YYCHAN"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["ahsys"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "ba"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "ahsys"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["alone"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "alone"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["den"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "den"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["lot"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "MA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "lot"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["qwert"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "qwert"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["sai2"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "sai2"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["sai3"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "sai3"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["sai4"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "sai4"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["tre"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "na"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "tre"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Akshh"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Akshh"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Akshhay"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Akshhay"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Dhyan"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Dhyan"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Laddu"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Laddu"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["MAYBANK"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "MAYBANK"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Sai"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Sai"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["YYCHAN"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "YYCHAN"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["ahsys"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "ahsys"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["alone"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "alone"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["den"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "den"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["lot"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "lot"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["qwert"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "qwert"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["sai2"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "sai2"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["sai3"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "sai3"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["sai4"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "sai4"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["tre"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "tre"
    }

  # module.github_repos.github_repository_ruleset.this["lot"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "lot-protection"
      + node_id     = (known after apply)
      + repository  = "lot"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # module.github_repos.github_repository_ruleset.this["sai2"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "sai2-protection"
      + node_id     = (known after apply)
      + repository  = "sai2"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 55 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @akshhayasg*